In [1]:
import pandas as pd
import numpy as np

## 판다스에서 제공하는 두 가지 구조

- Dataframe
- Series 

- 데이터프레임 -> 2차원구조로 이뤄진 행과열의 형태, 2차원리스트 개념
- 시리즈 -> 1차원구조로 이뤄진 구조, 브로드캐스팅 등 연산을 빠르게 할 수 있다.

### 3가지로 진행하기

- 1. 직접 데이터프레임을 만들기

- 2. 패키지내에 데이터 불러오기

- 3. 내가 만든 csv, excel 데이터 불러오기!

In [10]:
a = ['데이터전처리반','데이터분석모델링반','데이터분석적용반','프로그래밍기초반']

- 리스트 요소 접근하는법?
- [0]

In [7]:
a[0] #인덱스 접근

'데이터전처리반'

- 데이터프레임도 인덱스 접근!

In [9]:
b = [['데이터전처리반','데이터분석모델링반'],['데이터분석적용반','프로그래밍기초반']]

In [11]:
print(a)

['데이터전처리반', '데이터분석모델링반', '데이터분석적용반', '프로그래밍기초반']

In [12]:
print(b)

[['데이터전처리반', '데이터분석모델링반'], ['데이터분석적용반', '프로그래밍기초반']]

In [15]:
b[0][1] #인덱스 2개 뎁스로 들어간다. -> 행과 열 좌표로 생각할 수 있다.
# 데이터프레임도 위와 동일한 개념으로 들어간다.

'데이터분석모델링반'

In [17]:
#데이터프레임을 만드는 경우 
df_bda= pd.DataFrame({'분반':['분석입문','분석적용','분석모델링'],
             '학회원수':[100,200,300],
             '우수학회원수':[10,20,30]})

In [22]:
#2차원리스트

df_bda.loc[0][0]

'분석입문'

In [23]:
df_bda

      분반  학회원수  우수학회원수
0   분석입문   100      10
1   분석적용   200      20
2  분석모델링   300      30

- 데이터를 패키지를 통해 불러오기!

In [ ]:
pip install seaborn

In [24]:
import seaborn as sns

In [26]:
tt=sns.load_dataset('titanic')

In [27]:
#타이타닉 데이터 
tt

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

- 데이터를 직접 가지고 오기!

In [29]:
df_mpg=pd.read_csv('mpg.csv') # read_csv ,read_excel

In [30]:
df_mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

## 데이터 프레임의 구조를 정확히 이해하고 있어야 한다.

- 행과 열 2차원 구조 
- 2차원 구조에 맞게 우리가 데이터를 나눌 수 있다.

- 열 기준으로 데이터를 볼 수 있고
- 행 기준으로 데이터를 볼 수 있다.

In [34]:
df_bda

      분반  학회원수  우수학회원수
0   분석입문   100      10
1   분석적용   200      20
2  분석모델링   300      30

In [32]:
# 열기준( 컬럼) 기준으로 데이터 추출 경우 [컬럼1] , [[컬럼1, 컬럼2]]
df_bda['분반'] #시리즈 형태

0     분석입문
1     분석적용
2    분석모델링
Name: 분반, dtype: object

In [33]:
df_bda[['분반','학회원수']]

      분반  학회원수
0   분석입문   100
1   분석적용   200
2  분석모델링   300

In [35]:
df_bda['분반'].to_frame() # 시리즈를 -> 데이터프레임으로

      분반
0   분석입문
1   분석적용
2  분석모델링

- 행기준으로 데이터 추출

In [37]:
# loc(처음 생성된 데이터프레임 인덱스기준) , iloc(현재 기준 데이프레임 인덱스 기준)
# range슬라이싱으로 진행하면 된다.
df_bda.loc[:]

      분반  학회원수  우수학회원수
0   분석입문   100      10
1   분석적용   200      20
2  분석모델링   300      30

In [42]:
df_bda.loc[0:0]

     분반  학회원수  우수학회원수
0  분석입문   100      10

In [44]:
df_bda['분반'].loc[0]

'분석입문'

- 반복문으로 진행했을 때 어떤식으로 반환?

In [45]:
a

['데이터전처리반', '데이터분석모델링반', '데이터분석적용반', '프로그래밍기초반']

In [46]:
for i in a:
    print(i)

데이터전처리반
데이터분석모델링반
데이터분석적용반
프로그래밍기초반

In [47]:
# 데이터프레임 전체 잡고 반복문 하면 컬럼 출력
for i in df_bda:
    print(i)

분반
학회원수
우수학회원수

In [48]:
df_bda

      분반  학회원수  우수학회원수
0   분석입문   100      10
1   분석적용   200      20
2  분석모델링   300      30

In [49]:
for i in df_bda['학회원수']:
    print(i)

100
200
300

In [50]:
tt

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True